SOAPtoREST/map.json

{"Mappings":[{"Name":null,"Method":"GET","RouteTemplate":"getCityWeatherByZip/{ZIP}","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n                <soap:Body>\n                    <GetCityWeatherByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\">\n                        <ZIP>{ZIP}</ZIP>\n                    </GetCityWeatherByZIP>\n                </soap:Body>\n            </soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetCityWeatherByZIP","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"},{"Name":null,"Method":"GET","RouteTemplate":"getWeatherInformation","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n                <soap:Body>\n                </soap:Body>\n            </soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetWeatherInformation","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"},{"Name":null,"Method":"GET","RouteTemplate":"getCityForecastByZip/{ZIP}","SoapBody":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n                <soap:Body>\n                    <GetCityForecastByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\">\n                        <ZIP>{ZIP}</ZIP>\n                    </GetCityForecastByZIP>\n                </soap:Body>\n            </soap:Envelope>","SoapAction":"http://ws.cdyne.com/WeatherWS/GetCityForecastByZIP","SoapUrl":"http://wsf.cdyne.com/WeatherWS/Weather.asmx","ContentType":"text/xml"}]}